'''
Дано файл f, компоненти якого є цілими числами. Знайти кількість парних та
кількість двозначних чисел серед компонентів файлу. Результат вивести на екран.
Огороднік Марина Олександрівна, І курс, група 122А
'''
import random
f = open("f1.txt", "wt")  # відкриваємо файл у режимі запису тексту
for i in range(random.randint(10, 100)):  # циклічно записуємо у файл цілі числа, змінивши їх тип даних на str
    f.write(str(random.randint(0, 500))+'\n')
f.close()  # закриваємо файл
f = open("f1.txt", "rt")  # відкриваємо файл у режимі читання тексту
l = list(map(int, f.readlines()))  # виписуємо рядки файлу у список, змінивши тип даних на int
x, y, z = 0, 0, 0  # вводимо змінні-лічильники
for i in l:  # циклічно обходимо усі числа файлу
    if 10 <= i <= 99:  # перевірка чи є чило двозначним
        x += 1
    if i % 2 == 0:  # перевірка чи є число парним
        y += 1
    if 10 <= i <= 99 and i % 2 == 0:  # перевірка чи є число парним і двозначним
        z += 1
print(f'The number of even numbers: {x}\nThe number of two-digit numbers: {y}\nThe number of even two-digit numbers: {z}')